name: "Model5"
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: 1
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TRAIN
	}
	data_param {
		source: "../lmdb/train_lmdb"
		batch_size: 64
		backend: LMDB
	}
}
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: false
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TEST
	}
	data_param {
		source: "../lmdb/val_lmdb"
		batch_size: 32
		backend: LMDB
	}
}
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "data"
	top: "conv1"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 32
		kernel_size: 7
		stride: 1
		pad: 3
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu1"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
layer {
	name: "norm1"
	type: "LRN"
	bottom: "conv1"
	top: "norm1"
	lrn_param {
	    local_size: 5
	    alpha: 0.0001
	    beta: 0.75
	}
}
layer {
	name: "conv2"
	type: "Convolution"
	bottom: "norm1"
	top: "conv2"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 32
		kernel_size: 5
		stride: 1
		pad: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu2"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
layer {
	name: "norm2"
	type: "LRN"
	bottom: "conv2"
	top: "norm2"
	lrn_param {
		local_size: 5
		alpha: 0.0001
		beta: 0.75
	}
}
layer {
	name: "pool2"
	type: "Pooling"
	bottom: "norm2"
	top: "pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}
layer {
	name: "conv3"
	type: "Convolution"
	bottom: "pool2"
	top: "conv3"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 5
		stride: 3
		pad: 65
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu3"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}
layer {
	name: "norm3"
	type: "LRN"
	bottom: "conv3"
	top: "norm3"
	lrn_param {
		local_size: 5
		alpha: 0.0001
		beta: 0.75
	}
}
layer {
	name: "conv4"
	type: "Convolution"
	bottom: "norm3"
	top: "conv4"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu4"
	type: "ReLU"
	bottom: "conv4"
	top: "conv4"
}
layer {
	name: "norm4"
	type: "LRN"
	bottom: "conv4"
	top: "norm4"
	lrn_param {
		local_size: 5
		alpha: 0.0001
		beta: 0.75
	}
}
layer {
	name: "pool4"
	type: "Pooling"
	bottom: "norm4"
	top: "pool4"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "fc5"
	type: "InnerProduct"
	bottom: "pool4"
	top: "fc5"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 1024
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "relu5"
	type: "ReLU"
	bottom: "fc5"
	top: "fc5"
}
layer {
	name: "dropout5"
	type: "Dropout"
	bottom: "fc5"
	top: "fc5"
	dropout_param {
		dropout_ratio: 0.5
	}
}
layer {
	name: "fc6"
	type: "InnerProduct"
	bottom: "fc5"
	top: "fc6"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 1024
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "relu6"
	type: "ReLU"
	bottom: "fc6"
	top: "fc6"
}
layer {
	name: "dropout6"
	type: "Dropout"
	bottom: "fc6"
	top: "fc6"
	dropout_param {
		dropout_ratio: 0.5
	}
}
layer {
	name: "fc7"
	type: "InnerProduct"
	bottom: "fc6"
	top: "fc7"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "loss"
	type: "SoftmaxWithLoss"
	bottom: "fc7"
	bottom: "label"
	top: "loss"
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc7"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TRAIN
	}
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc7"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TEST
	}
}
