name: "Model2"
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: 1
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TRAIN
	}
	data_param {
		source: "../lmdb/train_lmdb"
		batch_size: 256
		backend: LMDB
	}
}
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: false
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TEST
	}
	data_param {
		source: "../lmdb/val_lmdb"
		batch_size: 128
		backend: LMDB
	}
}
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "data"
	top: "conv1"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 7
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu1"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
layer {
	name: "pool1"
	type: "Pooling"
	bottom: "conv1"
	top: "pool1"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "conv2"
	type: "Convolution"
	bottom: "pool1"
	top: "conv2"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 5
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu2"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
layer {
	name: "conv3"
	type: "Convolution"
	bottom: "conv2"
	top: "conv3"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu3"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}
layer {
	name: "pool3"
	type: "Pooling"
	bottom: "conv3"
	top: "pool3"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "fc4"
	type: "InnerProduct"
	bottom: "pool3"
	top: "fc4"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 1024
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "relu4"
	type: "ReLU"
	bottom: "fc4"
	top: "fc4"
}
layer {
	name: "dropout4"
	type: "Dropout"
	bottom: "fc4"
	top: "fc4"
	dropout_param {
		dropout_ratio: 0.5
	}
}
layer {
	name: "fc5"
	type: "InnerProduct"
	bottom: "fc4"
	top: "fc5"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "loss"
	type: "SoftmaxWithLoss"
	bottom: "fc5"
	bottom: "label"
	top: "loss"
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc5"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TRAIN
	}
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc5"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TEST
	}
}
