name: "Model1"
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: 1
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TRAIN
	}
	data_param {
		source: "../lmdb/train_lmdb"
		batch_size: 256
		backend: LMDB
	}
}
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	transform_param {
		mirror: false
		mean_file: "../lmdb/mean_file.binaryproto"
	}
	include {
		phase: TEST
	}
	data_param {
		source: "../lmdb/val_lmdb"
		batch_size: 100
		backend: LMDB
	}
}
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "data"
	top: "conv1"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 32
		kernel_size: 5
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "relu1"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
layer {
	name: "fc2"
	type: "InnerProduct"
	bottom: "conv1"
	top: "fc2"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 1024
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "relu2"
	type: "ReLU"
	bottom: "fc2"
	top: "fc2"
}
layer {
	name: "fc3"
	type: "InnerProduct"
	bottom: "fc2"
	top: "fc3"
	param {
		lr_mult: 1
		decay_mult: 0
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "loss"
	type: "SoftmaxWithLoss"
	bottom: "fc3"
	bottom: "label"
	top: "loss"
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc3"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TRAIN
	}
}
layer {
	name: "accuracy"
	type: "Accuracy"
	bottom: "fc3"
	bottom: "label"
	top: "accuracy"
	include {
		phase: TEST
	}
}
